{
	"info": {
		"download-cv": "Download my CV",
		"ani-1": "I am",
		"ani-3": "Web and Mobile",
		"ani-4": "Developer"
	},
	"about-me": {
		"title": "About Me",
		"info-1.title": "Who am I?",
		"info-1.description": "I am a 23-year-old computer scientist, dedicated for years to the world of technology and programming. Throughout my journey in the IT field, I have taken on different challenges, always giving my best to deliver the best possible product.",
		"info-2.title": "What do I do?",
		"info-2.description": "I develop software in various fields, including mobile applications, desktop applications, and websites. These range from Landing Pages and Dashboards to even a video game. My products stand out for following good programming practices and having an attractive, functional, and responsive design for any device.",
		"info-3.title": "Contact Me!",
		"info-3.description": "If you are interested in my expertise, do not hesitate to contact me. I am willing to work on any project that comes my way—I love challenges.",
		"contact": "Contact Me"
	},
	"experience": {
		"title": "Experience",
		"exp-1.rol": "Graphic Design Assistant",
		"exp-1.time": "2019",
		"exp-1.description": "In 2019, I had a work experience as an intern at a restaurant, where I assisted in the graphic design of the website, as well as performing organizational and general office tasks. I worked there for about a month.",
		"exp-2.rol": "Mobile Developer",
		"exp-2.time": "2024",
		"exp-2.description": "As part of my community service internship, I participated in the Midi Espol project, where I contributed to the development of the interactive educational game 'Mi Rutina.' I developed new game levels and implemented a communication mechanism to a dashboard to collect the results obtained by the children.",
		"exp-3.rol": "Web Developer",
		"exp-3.time": "2025 - Present",
		"exp-3.description": "As part of my business internship, I joined the web development team for the 'Etiquetas' project at Solinal."
	},
	"skills": {
		"title": "Skills",
		"window.title.full": "Programming Skills",
		"window.title.short": "Programming",
		"skill-languages.title.full": "Programming Languages",
		"skill-languages.title.short": "Languages",
		"skill-frontend.title.full": "Frontend Frameworks",
		"skill-frontend.title.short": "Frontend",
		"skill-backend.title.full": "Backend Frameworks",
		"skill-backend.title.short": "Backend",
		"skill-others.title.full": "Other Tools",
		"skill-others.title.short": "Others",
		"window-select": "Select an option...",
		"personal-skills.title": "Personal Skills",
		"personal-skill-1": "Teamwork",
		"personal-skill-2": "Creativity",
		"personal-skill-3": "Effective Communication",
		"personal-skill-4": "Commitment at All Times",
		"personal-skill-5": "Good English Proficiency"
	},
	"projects": {
		"title": "Projects",
		"more-info": "More information",
		"see-repo": "View repository",
		"project-dashboard.name": "Dashboard",
		"project-dashboard.description": "A website that shows the temperature, precipitation, UV rays, and other possible data for the next 5 days of a city in Ecuador. It includes a selector for provinces and cities for visualization. It also displays flood threat monitoring that could occur in the country. These data are gathered from https://www.gestionderiesgos.gob.ec/monitoreo-de-inundaciones/ via CORS for educational purposes.",
		"project-landing.name": "Landing",
		"project-landing.description": "A landing page related to video games, inspired by platforms like Steam. The main focus is on the website design. It does not have internal functionality.",
		"project-mpa.name": "MPA",
		"project-mpa.description": "A team project built with Angular that presents speedrun statistics (completing a game quickly). The main idea of the project lies in using the Angular framework to create shared components, interfaces, and connect to a Firebase database.",
		"project-flex-travel.name": "Flex & Travel",
		"project-flex-travel.description": "A mobile application project aimed at boosting tourism for all types of businesses. Both the frontend and backend were worked on separately. To view the backend of the project, visit: https://github.com/Fausto-Briones/LP-Proyecto2.",
		"project-catalogo.name": "Video Game Catalog",
		"project-catalogo.description": "The project simulates a video game catalog similar to Steam, using data structures like circular linked lists. It also has two views: one for users and another for administrators. Additionally, there are various methods to search for video games.",
		"project-visualizador.name": "File Viewer",
		"project-visualizador.description": "This project allows you to visualize files in a more general way, where the size of a file or directory will take up more or less space in the viewer. The program's behavior is based on multi-path trees. It has two modes of visualization: one by files and another by file extensions.",
		"project-rover.name": "Rover Simulator",
		"project-rover.description": "This project simulates two rovers on Mars, one solar and the other wind-powered. There are craters on Mars where materials will be sensed. The user can move around the planet using commands, plan routes, among other things. The two rovers can be used simultaneously thanks to multithreading.",
		"project-laberinto_encantado.name": "Enchanted Maze",
		"project-laberinto_encantado.description": "A cooperative and competitive multiplayer game where 4 teams face each other to escape the maze. You can also check the backend at: https://github.com/domorales/laberinto_encantado_backend/ and the full development at: https://domorales.github.io/portfolio-momentum/"
	},
	"404": {
		"not-found": "It looks like this page doesn't exist",
		"go-back": "But don't worry! By clicking this button, you can go back to the main page. I'll be waiting for you there!",
		"main-page": "Main Page"
	}
}
