{
	"info.download-cv": "Descarga mi CV",
	"info.ani-1": "Yo soy",
	"info.ani-3": "Desarrollador",
	"info.ani-4": "Web y Móviles",
	"about-me.title": "Sobre Mí",
	"about-me.info-1.title": "¿Quién soy?",
	"about-me.info-1.description": "Soy un joven informático de {{age}} años, dedicado hace años al mundo de la tecnología y de la programación. Durante mi recorrido en el mundo informático, he tomado diferentes desafíos pero siempre dándo lo mejor de mí para dar el mejor producto posible.",
	"about-me.info-2.title": "¿Qué hago?",
	"about-me.info-2.description": "Desarrollo software de distintos ámbitos, desde aplicaciones móviles, aplicaciones de escritorio y webs, entre las cuales se incluyen Landing Pages, Dashboards, incluso hasta un videojuego. Los productos se destacan por mantener buenas prácticas de programación y por tener un diseño atractivo, funcional y responsivo para cualquier dispositivo.",
	"about-me.info-3.title": "¡Contáctame!",
	"about-me.info-3.description": "Si está interesado en contar con mis conocimientos, no dude en contactarme. Estoy dispuesto a trabajar en cualquier proyecto que se me presente, me gustan mucho los desafíos.",
	"about-me.contact": "Contáctame",
	"experience.title": "Experiencia",
	"experience.exp-1.rol": "Ayudante Diseño Gráfico",
	"experience.exp-1.time": "2019",
	"experience.exp-1.description": "En el año 2019, tuve una experiencia laboral trabajando como pasante dentro de un restaurante, donde era ayudante de la parte del diseño gráfico de la página web, además de hacer trabajos de organización y de ofimática en general. Estuve trabajando alrededor de un mes.",
	"experience.exp-2.rol": "Desarrollador Móvil",
	"experience.exp-2.time": "2024",
	"experience.exp-2.description": "Como parte de mis prácticas de vinculación, participé en el proyecto Midi Espol, donde apoyé en la parte de desarrollo del juego interactivo educativo 'Mi Rutina', en el cual desarrollé nuevos niveles del juego. Además, implementé el mecanismo de comunicación a un dashboard para poder recopilar los resultados obtenidos por los niños.",
	"experience.exp-3.rol": "Desarrollador Web",
	"experience.exp-3.time": "Febrero 2025 - Mayo 2025",
	"experience.exp-3.description": "Como parte de mis prácticas empresariales, integré el grupo de desarrolladores web para el proyecto Etiquetas de la empresa Solinal.",
	"skills.title": "Habilidades",
	"skills.window.title.full": "Habilidades en Programación",
	"skills.window.title.short": "Programación",
	"skills.skill-languages.title.full": "Lenguajes de Programación",
	"skills.skill-languages.title.short": "Lenguajes",
	"skills.skill-frontend.title.full": "Herramientas Frontend",
	"skills.skill-frontend.title.short": "Frontend",
	"skills.skill-backend.title.full": "Herramientas Backend",
	"skills.skill-backend.title.short": "Backend",
	"skills.skill-others.title.full": "Otras Herramientas",
	"skills.skill-others.title.short": "Otros",
	"skills.window-select": "Selecciona una opción...",
	"skills.personal-skills.title": "Habilidades personales",
	"skills.personal-skill-1": "Trabajo en Equipo",
	"skills.personal-skill-2": "Creatividad",
	"skills.personal-skill-3": "Comunicación efectiva",
	"skills.personal-skill-4": "Compromiso a toda hora",
	"skills.personal-skill-5": "Buen nivel de Inglés",
	"projects.title": "Proyectos",
	"projects.more-info": "Más información",
	"projects.visit-page": "Visitar página",
	"projects.see-repo": "Ver repositorio",
	"projects.project-dashboard.name": "Dashboard",
	"projects.project-dashboard.description": "Página web que indica la temperatura, precipitaciones, rayos UV y otros datos posibles de los próximos 5 días de una ciudad del Ecuador. Cuenta con un selector de provincia y ciudades para su visualización. Además, muestra el monitoreo de amenazas de inundación que pueden ocurrir en el país. Estos datos son recopilados de <a class='underline font-bold' target='_blank' href = 'https://www.gestionderiesgos.gob.ec/monitoreo-de-inundaciones/'>https://www.gestionderiesgos.gob.ec/monitoreo-de-inundaciones/</a> mediante el mecanismo CORS para su uso didáctico.",
	"projects.project-landing.name": "Landing",
	"projects.project-landing.description": "Página de Landing referentes a videojuegos, basándose en plataformas como Steam. Lo relevante es el diseño de la página web. No cuenta con funcionalidad interna.",
	"projects.project-mpa.name": "MPA",
	"projects.project-mpa.description": "Proyecto en equipo realizado en Angular que presenta estadísticas de Speedrun (pasarse rápido un juego). La idea principal del proyecto está en el uso del framework Angular para la creación de componentes compartidos, interfaces y conexión a una base de datos Firebase.",
	"projects.project-flex-travel.name": "Flex & Travel",
	"projects.project-flex-travel.description": "Proyecto para aplicaciones móviles, centrado en impulsar el turismo en negocios de todo tipo. Se trabajó tanto la parte del Frontend, como la parte del Backend por separado. Para ver el backend del proyecto, visitar: https://github.com/Fausto-Briones/LP-Proyecto2.",
	"projects.project-catalogo.name": "Catálogo de Videojuegos",
	"projects.project-catalogo.description": "El proyecto consiste en simular un catálogo de videojuegos estilo Steam, donde se hace uso de Estructuras de Datos como las listas circulares enlazadas. Además, hay dos vistas: una para el usuario y otra para el administrador. Por último, existen diversas formas de búsqueda de videojuegos.",
	"projects.project-visualizador.name": "Visualizador de Archivos",
	"projects.project-visualizador.description": "Consiste en visualizar los archivos de una manera más general, donde el tamaño de un archivo o directorio ocupará más o menos espacio en el visualizador. El comportamiento del programa está basado en árboles multicaminos. Tiene dos modos de visualización: uno por archivos y otro por extensiones de archivo.",
	"projects.project-rover.name": "Simulación de Rovers",
	"projects.project-rover.description": "Este proyecto consiste en un simulador de dos róvers en Marte, uno solar y otro eólico. Hay cráteres en Marte donde se encuentran materias que serán sensadas. El usuario mediante comandos, se puede mover alrededor del planeta, puede planificar rutas, entre otros. Además, se pueden usar los dos róvers al mismo tiempo gracias al multithreading.",
	"projects.project-laberinto_encantado.name": "Laberinto Encantado",
	"projects.project-laberinto_encantado.description": "Juego multijugador cooperativo y competitivo donde 4 equipos se enfrentan entre sí para lograr salir del laberinto. <br/> Puedes visitar estos dos sitios: <br/><!--<b>Backend:</b> <a class='underline font-bold' target='_blank' href = 'https://github.com/domorales/laberinto_encantado_backend'>https://github.com/domorales/laberinto_encantado_backend</a><br/>--> <b>Desarrollo Completo:</b> <a class='underline font-bold' target='_blank' href='https://domorales.github.io/portfolio-momentum/'>https://domorales.github.io/portfolio-momentum/</a>",
	"404.not-found": "Al parecer esta página no existe",
	"404.go-back": "¡Pero tranquilo! Aplastando este botón podrás volver a la página principal. ¡Te espero ahí!",
	"404.main-page": "Página Principal"
}
